{
  "SAR": [
    "Distress call: vessel taking on water, 3 souls onboard.",
    "Overdue fishing vessel, last contact 6 hours ago.",
    "Personal locator beacon (PLB) activation reported, unknown number of survivors.",
    "Merchant ship reports flare sighted bearing 045 degrees, approximate range 15 NM.",
    "Emergency radio transmission received: vessel listing heavily.",
    "Capsized sailboat observed by commercial vessel; no contact with survivors.",
    "EPIRB distress signal detected 18 NM east of base; immediate response requested.",
    "Small plane emergency water landing reported; survivors may be in life rafts.",
    "Lost kayakers overdue by 8 hours; last seen heading south from coastline.",
    "Cargo vessel man overboard; search pattern established around last known position.",
    "Report of capsized pleasure craft; multiple persons possibly in water.",
    "Ice conditions worsening; stranded vessel requesting immediate evacuation.",
    "Mayday call: fishing boat engine fire, all crew abandoning ship.",
    "Request additional SAR assets if available; multiple survivors reported.",
    "Lifeboat adrift with unknown number of persons; spotted via aerial recon.",
    "High winds reported in search area; visibility reduced below 1 NM.",
    "Floating debris field located; survivors may be nearby.",
    "Large ferry disabled offshore; medical emergencies onboard.",
    "Sailboat missing after squall line passage; begin sector search.",
    "Last radar contact with overdue vessel occurred 2 hours ago; area identified."
  ],
  "HITRON": [
    "Fast boat sighted, high-speed target moving northbound.",
    "Suspected drug runner last spotted at given coordinates.",
    "Radar contact: unregistered small craft maneuvering evasively.",
    "Smuggler vessel reported — location approximated from last interception.",
    "Multiple fast boats operating in area; support assets recommended.",
    "Fast-moving contact detected; air interdiction authorized.",
    "Suspect vessel observed discarding contraband; recovery operations authorized.",
    "Launch at earliest opportunity to intercept suspect vessel before landfall.",
    "Intelligence reports drug transport vessel approaching coastline.",
    "Boarding team reports vessel refusing inspection; aerial overwatch needed."
  ],
  "LE": [
    "Suspicious vessel loitering in known trafficking corridor.",
    "Vessel failing to comply with orders; pursuit authorization granted.",
    "Visual sighting: high-speed watercraft operating without lights after dark.",
    "Vessel conducting unpermitted activities near coastline.",
    "Sector command requests maritime patrol intercept of known trafficking route.",
    "Unknown vessel observed transferring cargo at sea; prepare for pursuit.",
    "Fishing vessel ignoring boarding requests, proceed to intercept.",
    "Nighttime operations authorized; NVG equipment recommended if available.",
    "Suspect craft operating near international boundary line.",
    "Launch boarding team to enforce maritime security zone."
  ],
  "MSP": [
    "Routine shipping lane patrol; monitor for suspicious activity.",
    "Escort high-value cargo vessel through designated sector.",
    "Confirm vessel manifests match AIS broadcast data.",
    "Report any deviation from established shipping routes.",
    "Observe and record maritime traffic densities during patrol.",
    "Investigate reported unidentified surface contact.",
    "Monitor coastal fishing activity for compliance.",
    "Conduct security reconnaissance along harbor approaches.",
    "Patrol designated maritime exclusion zones.",
    "Maintain radar surveillance along main shipping corridor."
  ],
  "EP": [
    "Oil slick reported via satellite imaging; proceed to investigate.",
    "Floating debris field identified by merchant vessel.",
    "Suspected illegal dumping detected by aerial reconnaissance.",
    "Marine sanctuary perimeter patrol; monitor vessel compliance.",
    "Confirm containment boom placement near spill area.",
    "Conduct environmental survey flight over target sector.",
    "Observe fisheries for protected species violations.",
    "Report signs of marine life distress or mass die-off events.",
    "Monitor coastal erosion and pollution runoff patterns.",
    "Illegal dredging activity suspected in protected waters."
  ],
  "ME": [
    "Urgent medevac request from offshore platform Bravo-5.",
    "Medical evacuation needed for stroke patient aboard merchant vessel.",
    "Medevac request: compound fracture after industrial accident at sea.",
    "Diver incident reported; decompression illness suspected.",
    "Sailor with cardiac arrest symptoms requires immediate transport.",
    "Fisherman with severe lacerations from deck equipment failure.",
    "Crews report injured passenger aboard private yacht.",
    "Patient stabilized by ship's medic; aerial transport required.",
    "Medical emergency: suspected spinal injury, urgent extraction needed.",
    "Small passenger ferry reporting multiple medical casualties."
  ],
  "R": [
    "Reposition aircraft to forward operating base for readiness exercise.",
    "Transfer aircraft for maintenance at regional depot.",
    "Deploy additional air assets in support of surge operations.",
    "Redeploy to hurricane relief staging base.",
    "Ferry flight to major overhaul facility scheduled.",
    "Temporary relocation due to hangar availability limitations.",
    "Aircraft assigned to joint training deployment site.",
    "Strategic repositioning in anticipation of SAR surge.",
    "Support repositioning to cover downed operational unit.",
    "Forward deploy to seasonal operational theater."
  ],
  "T": [
    "Routine SAR pattern training sortie.",
    "Navigation and communications training flight around base.",
    "Area familiarization flight for new aircrew.",
    "Emergency procedures refresher drill during sortie.",
    "Low-level coastal navigation exercise.",
    "Night operations familiarization mission.",
    "Instrument approach training sortie.",
    "Formation flying practice with wingman.",
    "Deck landing practice (helo ops) if available.",
    "Simulated multi-vessel SAR training scenario."
  ]
}
